// //alert('Для тетста, всем привет')

// // Задача1: вычислить результат 158+2 и вывести значение выражения в диалоговое окно.
// // let b = prompt("Введи число")
// // let a = prompt("Iput")
// // alert(+a + +b)

// // Задача2: написать функцию выводящую в диалоговом окне текст и переменную. 
// // Например, “Привет, Алевтина”. Где имя “Алевтина” это внешняя переменная.
// // function task(a){
// //     alert(`Привет, ${a}`);  
// // }
// // let a = prompt();
// // task(a)

// Задача: вывести на экран в диалоговом окне текст с сообщением: “Вы уверены?” и кнопками «ОК» , «Отмена».
// При нажатии на кнопку “ОК” вывести в диалоговом окне текст с сообщением “Мы рады, что Вы уверены!”.
// При нажатии на кнопку “Отмена” вывести в диалоговом окне текст с сообщением “Жаль, что Вы не уверены…”.

// var question = confirm("Вы уверены?");
// if (question == true){
//     alert("We are gladed")
// }
// else if (question == false){
//     alert('We are facking you')
// }

// var a = prompt();

// switch (+a){
//     case 18:
//         alert("eighteen");
//         break;
//     case 10:
//         alert("homework");
//         break;
//     case 30:
//         alert("work");
//         break;
//     default:
//         alert("ass");
//         break;
// }

// Задание №7. Создайте массив с произвольными элементами. Выведите в диалоговом окне(на экран) 
// все данные из массива. При желании можете его предварительно отсортировать, как вам будет 
// удобно(по возрастанию или убыванию)
// Задание 1: Создайте всплывающее окно, которое спрашивает имя у пользователя и выводит его с помощью функции.
// let nick = prompt("Введите ваше имя")
// function out(nick){
//     alert(`Привет ${nick}`);
// }
